Repository: 84000/data-translation-memory
Catalog: toh188-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: King Endowed with Islands then went to the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara, and having gone there he bowed his head at the Blessed One’s feet.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་སྐབས་དེ་གསོལ་པ་དང་།
en: Having sat to one side, he informed him of the situation.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་སྙིང་ལས་ཆུང་ངུར་གྱིས་ལ་སླར་སོང་ཤིག །
en: “The Blessed One replied, ‘Be at ease, great king, and return home.

source: ང་ནི་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་དུ་གཤེགས་སོ། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དགེ་སློང་གི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: I will travel to the palace Padmāvatī.’

source: མི་དང་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། རྒྱལ་པོ་གླིང་ལྡན་ཡང་རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་། རྒྱལ་པོའི་ཚོགས་མང་པོ་དང་། རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་བདོག་པ་ཆེན་པོ་དང་།
en: “Then the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara, surrounded by the saṅgha of monks and an assembly of bodhisattvas and by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans, set out together with King Endowed with Islands, who was surrounded and attended by royal power, a large royal assembly, great royal displays, great royal possessions, great royal wealth, and great royal pageantry.

source: རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་རྣམ་པར་རྩེ་བ་ཆེན་པོ་དང་ཆས་ཏེ་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་ཐབས་ཅིག་ཏུ་གཤེགས་སོ། །ཀུན་དགའ་བོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེ་རིམ་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: “Thus, Ānanda, the Thus-Gone Dīpaṅkara gradually made his way to the palace Padmāvatī.

source: དེའི་ཚེ་ན་རིའི་རྒྱལ་པོ་གངས་རི་ལ་བྲམ་ཟེ་རིན་པོ་ཆེ་ཞེས་བྱ་བ་ཞིག་འདུག་སྟེ། བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་ཙམ་ལ་བསྟན་བཅོས་དང་རིག་བྱེད་དང་། གསང་སྔགས་ཐམས་ཅད་སློབ་ཏུ་འཇུག་གོ། །དེ་ན་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་གི་ནང་ན་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཅེས་བྱ་བ་གཞོན་ནུ་དར་ལ་བབ་པ། གཟུགས་བཟང་བ།
en: “At that time, at the king of mountains, Himālaya, there was a brahmin known as Ratna who was instructing some five hundred young brahmin boys in the treatises, the Vedas, and all the secret mantras.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ། གསང་སྔགས་དང་། བསྟན་བཅོས་དང་། ཆོག་ཤེས་པ་ཇི་སྙེད་པ་ཐམས་ཅད་ལ་མཁས་པ་ཞིག་ཡོད་དོ། །ཀུན་དགའ་བོ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཅེས་བྱ་བས་མཁན་པོའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Among those five hundred or so brahmin boys, there was a brahmin boy known as Megha, who was in the prime of youth, shapely, handsome, pleasant to behold, provided with a supremely rich and fine complexion, and skilled in all the varieties of secret mantras, treatises, and rituals.

source: ཀྱེ་མཁན་པོ་བདག་གྲོང་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་མཆིའོ། །
en: “At that time, Ānanda, the brahmin boy Megha bowed his head at the feet of the master and said, ‘O master, I will go to the villages, cities, provinces, countries, and royal cities.’

source: མཁན་པོས་སྨྲས་པ། ཀྱེ་བྲམ་ཟེའི་ཁྱེའུ་བདག་ཅག་བྲམ་ཟེ་རྣམས་ཀྱི་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། གང་གིས་བསྟན་བཅོས་དང་། རིག་བྱེད་དང་། གསང་སྔགས་ཐམས་ཅད་ལོབས་པ་དེས་མཁན་པོ་ལ་ཟོང་ལྔ་བརྒྱ་དང་། རས་ཟུང་གཅིག་དང་། ཁར་བ་དང་།
en: “The master replied, ‘O young brahmin, this is the law among us brahmins: anyone who has mastered all the treatises, Vedas, and secret mantras must give the master five hundred coins, one bolt of fabric, a staff, and a water flask.’

source: རིལ་བ་རྣམས་སྦྱིན་དགོས་སོ། །བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་སྨྲས་པ། མཁན་པོ་བདག་ལ་པགས་པ་དང་། ཁར་བ་དང་། རིལ་བ་མ་གཏོགས་པར་ཅི་ཡང་མ་མཆིས་པས་མཆིའོ། །
en: “The brahmin boy Megha said, ‘Master, since I have nothing at all except a skin, a staff, and a water flask, I will go.’

source: ལན་གསུམ་གྱི་བར་དུ་གསོལ་ནས་དེ་བཞིན་གྱིས་ཤིག་ཅེས་སྨྲས་སོ། །
en: “After he requested a third time, the master said, ‘So be it!’ ”

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་རིམ་གྱིས་རིའི་རྒྱལ་པོ་གངས་ལས་བབས་ནས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་ཞུགས་སོ། །
en: “The brahmin boy Megha gradually descended from the king of mountains, Himālaya, and entered the villages, cities, provinces, countries, and royal cities.

source: དེའི་ཚེ་ན་གྲོང་ཁྱེར་ཆེན་པོ་བདེ་བར་ཕ་རོལ་ཏུ་འགྲོ་བ་ན་བྲམ་ཟེ་ས་ག་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ།
en: At that time, in the great city Gone to Bliss, there dwelled a brahmin known as Suviśākha.

source: དེ་ལ་བུ་མོ་བཟང་ལེན་ལྡན་ཞེས་བྱ་བ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: He had a daughter called Receiver of Goodness, who was shapely, beautiful, pleasant to behold, and provided with a supremely rich and fine complexion.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་ཡོད་པ་དེའི་ཕྱིར་ཉི་མ་རེ་རེ་ཞིང་བྲམ་ཟེ་བཞི་ཁྲི་ལ་ཟན་སྦྱིན་པར་བྱེད་ཅིང་། དེ་རྣམས་ཀྱི་ནང་ན་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་གང་ཡིན་པ་དེ་ལ་བདག་གི་བུ་མོ་སྦྱིན་ནོ་སྙམ་པ་དང་།
en: Every day, for her sake, he had food given to forty thousand brahmins, thinking, ‘I will give my daughter to whomever is especially exalted among them.’

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་ཞིག་གིས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལ་གྲོང་ཁྱེར་ཆེན་པོ་བདེ་བར་ཕ་རོལ་ཏུ་འགྲོ་བའི་ལམ་བསྟན་ནོ། །
en: “One of the gods from the Śuddhāvāsa realm showed the brahmin boy Megha the path to the great city Gone to Bliss.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་མཆོད་སྦྱིན་གྱི་གནས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ཏོ། །བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་མཆོད་སྦྱིན་གྱི་གནས་དེར་ཕྱིན་མ་ཐག་ཏུ་དེའི་ཚེ་བུ་མོ་དེས་རང་གི་ཕ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཡབ་བྲམ་ཟེའི་ཁྱེའུ་འདིའི་མཚན་མ་ཇི་ལྟར་གདའ་བ་ལས་ན་འདི་བདག་གི་ཁྱིམ་ཐབ་ཏུ་འགྱུར་རོ། །
en: The brahmin boy Megha arrived at the site of the offering, and as soon as the brahmin boy Megha reached the site of the offering, the girl said to her parents, ‘Father, if the qualities of this one are indeed as they seem, may he become my husband.’

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་བྲམ་ཟེ་དེ་དག་ཐམས་ཅད་དང་ལྷན་ཅིག་ཀུན་ཏུ་སྨྲ་བར་བྱེད་ཅིང་། དེ་ན་བྲམ་ཟེ་སྤྲིན་ཉིད་བསྟན་བཅོས་དང་། གསང་སྔགས་དག་གིས་ཁྱད་པར་དུ་འཕགས་སོ། །
en: “The brahmin boy Megha then engaged in conversation with all the other brahmins, and among them the brahmin Megha was superior in the treatises and secret mantras.

source: དེའི་ཚེ་ན་མཆོད་སྦྱིན་གྱི་གནས་དེར་བྲམ་ཟེ་དུམ་བུ་བྱིན་ཞེས་བྱ་བ་ཞིག་རྒན་གྲལ་དུ་འདུག་སྟེ། མཆོད་སྦྱིན་བྱེད་དོ། །
en: At that time, at the site of the offering, there was a brahmin known as Giver of Pieces, who performed offerings sitting among the elders.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་བྲམ་ཟེ་དུམ་བུ་བྱིན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The brahmin boy Megha went to where the brahmin Giver of Pieces was.

source: བྲམ་ཟེ་དུམ་བུ་བྱིན་དང་ལྷན་ཅིག་ཏུ་རིག་བྱེད་དང་གསང་སྔགས་དག་སྨྲ་བར་བྱེད་ཅིང་། དེ་ན་འདི་ལྟ་སྟེ། སྤྲིན་ཉིད་རིག་བྱེད་དང་། གསང་སྔགས་དང་། བསྟན་བཅོས་དག་གིས་ཁྱད་པར་དུ་འཕགས་སོ། །
en: There he engaged in conversation about the Vedas and mantras with the brahmin Giver of Pieces, and it turned out that Megha was superior in the Vedas, secret mantras, and treatises.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་བྲམ་ཟེ་དུམ་བུ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་བྲམ་ཟེ་བདག་ཅག་བྲམ་ཟེ་རྣམས་ཀྱི་ཆོས་ཉིད་ནི་གང་གིས་བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་པ་དེ་སྟན་མཆོག་ལ་འདུག་པ་ཡིན་ནོ། །
en: “The brahmin boy Megha then said to the brahmin Giver of Pieces, ‘O brahmin, the law among us brahmins is that whoever has understood and mastered the treatises should sit on the best seat.’

source: དེ་ནས་ཡང་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་བྲམ་ཟེ་དུམ་བུ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེ་ཆེན་པོ་འདིར་ཁོ་བོ་འདུག་གིས་སྟན་འདི་ལས་ལོངས་ཤིག །
en: “Then the brahmin boy Megha again spoke to the brahmin Giver of Pieces: ‘Great brahmin, I will sit here, so get up from this seat.’

source: དེ་ནས་བྲམ་ཟེ་དུམ་བུ་བྱིན་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེའི་ཁྱེའུ་ང་སྟན་འདི་ལས་མ་བསླང་ཤིག་དང་།
en: “The brahmin Giver of Pieces replied, ‘Young brahmin, do not make me get up from this seat.

source: ཁོ་བོས་ཟོང་ལྔ་བརྒྱ་ཐོབ་པ་ཁྱོད་ལ་སྦྱིན་ནོ་སྨྲས་པ།
en: I will give you five hundred coins that I have obtained.’

source: ཁོ་བོ་ལ་མི་དགོས་སོ། །
en: “ ‘I do not need them.’

source: དེ་མ་ལངས་པ་དང་དེའི་མགྲིན་པ་ནས་བཟུང་སྟེ་བསླང་ངོ་། །
en: “He did not stand, so Megha grabbed him by the neck and made him get up.

source: དེ་ནས་བྲམ་ཟེ་དུམ་བུ་བྱིན་གྱིས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལ་སྨྲས་པ། བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ཀྱིས་ཁོ་བོ་སྟན་འདི་ལས་བསླངས་ནས་ཐོ་བཙམས་ཤིང་དངངས་པར་བྱས་པས་ཁྱོད་གང་དང་གང་དུ་སྐྱེས་པའི་སྐྱེ་བ་ཐམས་ཅད་དུ་སྦྱིན་པའི་བར་ཆད་བྱའོ་ཞེས་དམ་བཅས་སོ། །
en: The brahmin Giver of Pieces said to the brahmin boy Megha, ‘Young brahmin, in making me get up from this seat, you have treated me with contempt and startled me, so I swear that wherever you take birth, your giving will always be interrupted.’

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་སེང་གེའི་ཁྲི་དེ་ལ་འདུག་གོ། །
en: “Then the brahmin boy Megha sat on the lion throne.

source: དེ་ནས་བྲམ་ཟེ་ས་ག་བཟང་པོས་བུ་མོ་བཟང་ལེན་ལྡན་ལག་གཡས་པས་བཟུང་སྟེ། གསེར་གྱི་ཁར་བ་དང་། རིལ་བ་དང་། རས་ཟུང་གཅིག་དང་། ཟོང་ལྔ་བརྒྱ་ཁྱེར་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “The brahmin Suviśākha, holding his daughter Receiver of Goodness with his right hand and carrying a golden staff, a water flask, a bolt of fabric, and five hundred coins, went to where the brahmin boy Megha was.

source: བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འདི་དག་ལོང་ཤིག །
en: On arriving there, he said to the brahmin boy Megha, ‘Noble son, take these.’

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་ཟོང་ལྔ་བརྒྱ་དང་། རས་ཟུང་གཅིག་དང་། ཁར་བ་དང་། རིལ་བ་རྣམས་བླངས་ཏེ་བུ་མོ་དེ་མ་བླངས་སོ། །
en: “The brahmin boy Megha took the five hundred coins, the bolt of fabric, the staff, and the water flask, but he did not accept the girl.

source: འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །བུད་མེད་འདིས་ཅི་ཞིག་བྱ།
en: He said, ‘What is the use of this woman?

source: བུད་མེད་ནི་སྤྲེའུ་དང་འདྲ་སྟེ། རྒོད་པ་འཕྱར་བ་དགེ་བའི་བར་ཆད་བྱེད་པ་ཡིན་ལ།
en: Women are like monkeys—they give rise to agitation and create obstacles to virtue.

source: ཁོ་བོ་ནི་དགོན་པ་དང་རབ་ཏུ་དབེན་པ་རྣམས་ན་གནས་པས་འདི་ཁོ་བོ་ལ་མི་དགོས་སོ། །
en: Since I dwell in hermitages and solitary places, I have no need for this.’

source: རིགས་ཀྱི་བུ་བདག་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ལོང་ཤིག །
en: “ ‘Noble son, please accept out of compassion for me.’

source: དེས་མ་བླངས་སོ། །
en: “He did not accept.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་མཆོད་སྦྱིན་གྱི་གནས་དེ་ནས་སོང་སྟེ་རིའི་རྒྱལ་པོ་གངས་ག་ལ་བ་དེར་སོང་ངོ་། །
en: The brahmin boy Megha left the place of offering and set out for Himālaya, the king of mountains.

source: དེ་ནས་བྲམ་ཟེ་ས་ག་བཟང་པོས་བུ་མོ་བཟང་ལེན་ལྡན་ལ་སྨྲས་པ། བུ་མོ་ཁྱོད་ཁྱིམ་ཐབ་ཀྱི་ཕྱི་བཞིན་ཅིའི་ཕྱིར་མི་འགྲོ།
en: “Then the brahmin Suviśākha said to the girl Receiver of Goodness, ‘Daughter, why do you not follow your husband?’

source: དེས་དེའི་ཚིག་མཉན་ཏེ། མཉན་ནས་རིའི་རྒྱལ་པོ་གངས་ག་ལ་བ་དེ་ལོགས་སུ་འཕགས་སོ། །
en: “Having heard his words, the girl set out in the direction of Himālaya, the king of mountains.

source: དེའི་ཚེ་ན་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་ཞིག་གིས་རིའི་རྒྱལ་པོ་གངས་སུ་འགྲོ་བའི་ལམ་མི་སྣང་བར་བྱས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་དུ་གང་ནས་འགྲོ་བའི་ལམ་བསྟན་ཅིང་།
en: “At that time, one of the gods from the Śuddhāvāsa realm had obscured the path to Himālaya, the king of mountains, and made the path that led to the king’s palace, Padmāvatī, clear.

source: གང་དུ་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་དྲོ་འདེབས་པ་དེར་བུ་མོ་བཟང་ལེན་ལྡན་ཡང་དགོངས་འདེབས་སོ། །
en: Wherever the brahmin boy Megha stopped for a midday meal, the daughter Receiver of Goodness stayed overnight.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་དར་གྱི་ལྡ་ལྡི་བྲེས་པ། མེ་ཏོག་བཀྲམ་པ། བདུག་སྤོས་འཐུལ་བའི་སྣོད་དངར་བ་མཐོང་ནས་དེས་དྲིས་པ། གྲོང་ཁྱེར་ཆེན་པོ་འདི་ཅིའི་རྒྱུས་མངོན་པར་བརྒྱན་པར་གྱུར།
en: “When the brahmin boy Megha spotted the king’s palace, Padmāvatī, which was adorned with silken tassels, scattered with flowers, and set with an arrangement of containers of incense, he asked, ‘Why is this great city so finely decorated?’

source: དེ་ནས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་རྣམས་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ཀྱིས་མ་ཐོས་སམ།
en: “The residents of the royal city of the king’s palace, Padmāvatī, replied to the brahmin boy Megha, ‘Young brahmin, have you not heard?

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: A thus-gone, worthy, complete and perfect buddha called Dīpaṅkara has emerged in the world.

source: དེ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་སྤྱན་དྲངས་ནས་དེ་འདིར་བྱོན་པའི་ཕྱིར་གྲོང་ཁྱེར་ཆེན་པོ་མངོན་པར་བརྒྱན་ཏོ། །
en: King Ajātaśatru invited him, and because he has come here, the great city has been finely decorated.’

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་བྲམ་ཟེ་རྣམས་ཀྱི་ནང་ན་གང་བསྟན་བཅོས་ཐམས་ཅད་ལ་སྤྱོད་པ་གསལ་ཞིང་མཁས་པ་ཡང་དཀོན་ན།
en: “The brahmin boy Megha thought, ‘If among us brahmins it is rare to find one who is clear in conduct and learned in all the treatises, why mention having such a precious being emerge in the world?

source: སེམས་ཅན་རིན་པོ་ཆེ་འདི་ལྟར་འཇིག་རྟེན་དུ་བྱུང་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཀྱིས་བདག་གིས་ཟོང་ལྔ་བརྒྱ་པོ་འདིས་མེ་ཏོག་ཉོས་ལ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་གོར་མ་ཆག་སྙམ་ནས་དེས་ཕན་ཚུན་མེ་ཏོག་བཙལ་ན་གང་ནས་ཀྱང་མ་རྙེད་པ་དང་།
en: I should without a doubt spend these five hundred coins on flowers and offer them to the Thus-Gone One.’ “He searched everywhere for flowers but was unable to find them anywhere.

source: རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་རྣམས་ན་རེ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ཀྱིས་མ་ཐོས་སམ།
en: The residents of the royal city of the king’s palace, Padmāvatī, said, ‘Young brahmin, have you not heard?

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲས་བཀའ་སྩལ་ཏེ། མེ་ཏོག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལ་མཆོད་པ་བྱ་དགོས་ཀྱིས།
en: King Ajātaśatru has declared, “All flowers must be offered to the Thus-Gone Dīpaṅkara.

source: འདི་ལྟར་སུ་ཡང་མེ་ཏོག་ཉོར་ཡང་མི་གནང་། འཚོང་དུ་ཡང་མི་གནང་ངོ་། །
en: Thus, no one has permission to purchase flowers, or to sell them.

source: གང་ཞིག་གིས་ཉོས་སམ་བཙོངས་ན་ངས་དེ་ཆད་པ་ཆེན་པོས་གཅད་དོ་ཞེའོ། །
en: I will punish severely anyone who buys or sells them.” ’

source: དེ་མེ་ཏོག་ཚོལ་བ་ན་བུ་མོ་བཟང་ལེན་ལྡན་མདུན་དུ་འདུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེའི་ཁྱེའུ་ཅི་ཚོལ།
en: “When he continued to search for flowers, the girl Receiver of Goodness sat before him and asked, ‘Young brahmin, what are you looking for?’

source: བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་སྨྲས་པ། བུ་མོ་མེ་ཏོག་ཚོལ་ལོ། །
en: “The brahmin boy Megha replied, ‘I am looking for flowers, girl.’

source: དེ་ནས་བུ་མོ་བཟང་ལེན་ལྡན་མེ་ཏོག་ཕྲེང་བརྒྱུད་མཁན་ཞིག་གི་ཁྱིམ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་མེ་ཏོག་ཕྲེང་བརྒྱུད་མཁན་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “The girl Receiver of Goodness then went to the house of a garland maker.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ལ་མེ་ཏོག་བྱིན་ཅིག །
en: When she arrived there, she requested the garland maker, ‘Noble son, give me flowers.

source: ཁོ་མོའི་ཁྱིམ་ཐབ་ལ་དགོས་སོ། །
en: My husband needs them.’

source: མེ་ཏོག་ཕྲེང་བརྒྱུད་མཁན་གྱིས་སྨྲས་པ། བུ་མོ་ཁྱོད་ཀྱིས་མ་ཐོས་སམ།
en: “The garland maker said, ‘Girl, have you not heard?

source: འདི་ལྟར་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏེ། མེ་ཏོག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལ་མཆོད་པ་བྱ་དགོས་ཀྱིས།
en: King Ajātaśatru declared thus: “All flowers must be offered to the Thus-Gone Dīpaṅkara.

source: འདི་ལྟར་སུ་ཡང་མེ་ཏོག་འཚོང་དུ་འང་མི་གནང་།
en: Thus, no one has permission to sell flowers, or to purchase them.

source: ཉོར་ཡང་མི་གནང་ངོ་། །གང་ཞིག་གིས་ཉོས་སམ་བཙོངས་ན་ངས་དེ་ཆད་པ་ཆེན་པོ་གཅད་དོ་ཞེའོ། །
en: I will punish severely anyone who buys or sells them.” ’

source: ལན་གསུམ་གྱི་བར་དུ་བསླང་བ་དང་དེ་བཞིན་བྱའོ་ཞེས་ཟེར་རོ། །
en: “Three times the girl asked, until he said, ‘So be it!’

source: དེ་ནས་བུ་མོ་བཟང་ལེན་ལྡན་གྱིས་བུམ་པ་བླངས་ནས་ཨུད་པ་ལ་བདུན་བཅུག་སྟེ།
en: The girl Receiver of Goodness then took up a vase and placed in it seven utpala flowers.

source: གྲོང་ཁྱེར་དུ་སོང་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་མཐོང་བ་དང་མདུན་དུ་འདུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “Departing for the city, she saw the brahmin boy Megha.

source: བྲམ་ཟེའི་ཁྱེའུ་ཅི་ཚོལ།
en: She sat before him and asked, ‘Young brahmin, what are you looking for?’

source: བུ་མོ་མེ་ཏོག་ཚོལ་ལོ། །སྨྲས་པ།
en: “He replied, ‘I am looking for flowers, girl.’

source: བྲམ་ཟེའི་ཁྱེའུ་ཅི་བྱ།
en: “ ‘Young brahmin, what for?’

source: སྨྲས་པ།
en: she asked.

source: བུ་མོ་བསྐྱེད་པར་བྱའོ། །བུ་མོས་སྨྲས་པ།
en: “He replied, ‘Girl, I will plant them.’

source: ཨུད་པ་ལ་བཏོགས་ཟིན་པ་གང་དག་ཡང་སྐྱེ་བར་འགྱུར་བ་ནི་ཁོ་མོས་ནམ་ཡང་མ་ཐོས་མ་མཐོང་ངོ་། །
en: “The girl said, ‘I have never heard of or seen an utpala flower that, already plucked, will grow again.’

source: སྨྲས་པ། བུ་མོ་གང་ལ་བསྐྱེད་པ་ཙམ་གྱིས་སྐྱེ་བའི་བསོད་ནམས་ཀྱི་ཞིང་དེ་ལྟ་བུ་ལ་བསྐྱེད་དོ། །
en: “ ‘Girl, I will plant them in a field of merit in which they will grow as soon as they are planted.’

source: དེས་སྨྲས་པ། གལ་ཏེ་ཁོ་མོ་གང་དང་གང་དུ་སྐྱེས་པའི་སྐྱེ་བ་ཐམས་ཅད་དུ་ཁྱོད་ཁོ་མོའི་ཁྱིམ་ཐབ་ཏུ་འགྱུར་བ་དམ་འཆའ་ན་དེའི་ཕྱིར་ཨུད་པ་ལ་སྦྱིན་ནོ། །
en: “She replied, ‘If you promise that in all lifetimes, wherever and whenever I take birth, you will always be my husband, I will give you these utpala flowers.’

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་དགོན་པ་དང་རབ་ཏུ་དབེན་པ་ན་གནས་པ་ཡིན་ལ།
en: “The brahmin boy Megha thought, ‘I am someone who dwells in hermitages and solitary places.

source: བུད་མེད་ནི་རྒོད་པ། འཕྱར་བ། དགེ་བའི་རྩ་བའི་བར་ཆད་བྱེད་པ་ཡིན་པས་བུད་མེད་འདིས་ཅི་ཞིག་བྱ་སྙམ་མོ། །
en: Since women create agitation, excitement, and obstacles to roots of virtue, what use is this woman?’

source: ལན་བདུན་གྱི་བར་དུ་སྨྲས་པ་དང་། དེ་བཞིན་དུ་གྱུར་ཅིག་ཅེས་སྨྲས་སོ། །
en: “She repeated this seven times, until he said, ‘So be it!’ ”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །འདི་སྐད་ངས་ཐོས་སྔོན་སྲིད་ན། །
en: Then, at that time, the Blessed One spoke these verses: “Thus did I hear.

source: སངས་རྒྱས་མར་མེ་འཇིག་རྟེན་བྱུང་། །འཁོར་ནི་མང་པོ་བདུན་སྟོང་དང་། །པད་མ་ཅན་དུ་དེ་ཕྱིན་ཏོ། །
en: In times past The Buddha Dīpaṅkara emerged in the world And traveled to Padmāvatī With a large retinue of seven thousand.

source: དེ་ཡི་ཕྱིར་ནི་རྒྱལ་མཚན་བསྒྲེངས། །
en: “For that reason victory banners were raised.

source: རྔ་ནི་བརྒྱ་ཕྲག་དེ་ཕྱིར་བརྡུངས། །
en: That is why drums, hundreds of them, were beaten.

source: གྲོང་ཁྱེར་ཐམས་ཅད་ཀུན་སྦྱངས་ཤིང་། །ལམ་སྲང་བཞི་ནི་དེ་ཕྱིར་བརྒྱན། །
en: For that purpose the whole city was cleaned, And the four streets were decorated.

source: གྲོང་ཁྱེར་བརྒྱན་པ་དེ་མཐོང་ནས། །བྲམ་ཟེའི་ཁྱེ་འུས་དྲིས་པ་ནི། །གང་གི་ཕྱིར་ནི་རྒྱལ་མཚན་བསྒྲེངས། །
en: “Seeing that city adorned, The brahmin boy asked, ‘Why have victory banners been raised?

source: གང་ཕྱིར་རྔ་ནི་བརྒྱ་ཕྲག་བརྡུངས། །
en: For what reason are hundreds of drums beaten?

source: གྲོང་ཁྱེར་ཐམས་ཅད་ཀུན་སྦྱངས་ཤིང་། །གང་ཕྱིར་ལམ་སྲང་བཞི་བརྒྱན་པའི། །
en: Why was the city cleaned And the four streets decorated?

source: བསམ་པ་དེ་ནི་ལུང་སྟོན་ཅིག །
en: Someone please explain this matter!’

source: རིག་བྱེད་ཤེས་ཁྱོད་མ་ཐོས་སམ། །
en: “ ‘Knower of Vedas, have you not heard?

source: སངས་རྒྱས་མར་མེ་འཇིག་རྟེན་བྱུང་། །འཁོར་ནི་མང་པོ་བདུན་སྟོང་དང་། །པད་མ་ཅན་དུ་དེ་བྱོན་ཏེ། །
en: The Buddha Dīpaṅkara has emerged, And he comes to Padmāvatī With a large retinue of seven thousand.

source: དེ་ཕྱིར་རྔ་ནི་བརྒྱ་ཕྲག་བརྡུངས། །
en: That is why hundreds of drums are beaten.

source: གྲོང་ཁྱེར་ཐམས་ཅད་ཀུན་སྦྱངས་ཤིང་། །དེ་ཕྱིར་ལམ་སྲང་བཞི་བརྒྱན་ཏོ། །
en: For that purpose the whole city was cleaned And the four streets decorated.’

source: སངས་རྒྱས་ཀྱི་ནི་སྒྲ་ཐོས་ནས། །སངས་རྒྱས་ཡོན་ཏན་གྱིས་མགུ་སྟེ། །རིངས་པར་མྱུར་དུ་སོང་བ་དང་། །
en: “Hearing mention of the Buddha, He was impressed by the Buddha’s qualities And traveled there swiftly without hesitation.

source: རྒྱང་ནས་བྲམ་ཟེའི་བུ་མོ་མཐོང་། །པད་མ་ཨུད་པལ་གཡོ་བའི་མིག །
en: “From afar he saw a brahmin girl With darting eyes like utpala flowers.

source: ཆུ་སྐྱེས་ཐོགས་ཤིང་སྒོ་ན་འདུག །དེ་ཡིས་བྲམ་ཟེའི་ཁྱེའུ་མཐོང་ནས། །
en: Sitting at the door holding a lotus, She spied the brahmin boy.

source: སྙན་པས་སྨྲ་བར་བྱ་བའི་ཕྱིར། །ཀ་ལ་པིང་ཀ་རྨ་བྱའི་སྒྲ། །ཡིད་འོང་ངང་མོ་ཁུ་བྱུག་སྒྲ། །སྒྲ་ཆེན་སྤངས་ནས་ཚངས་པའི་སྒྲས། །བྲམ་ཟེའི་ཁྱེའུ་ལ་བུ་མོས་སྨྲས། །
en: “To converse with pleasant words, With the voice of the kalaviṅka and the peacock, With the pleasing sounds of the goose and the cuckoo, Abandoning cacophony and with the voice of Brahmā, The girl spoke to the brahmin boy: “ ‘What is it, boy?

source: ཁྱེའུ་ཅི་ནགས་ཀྱི་ནང་ན་དེ། །སྦྱིན་སྲེག་བྱེད་ཅིང་རིག་འདོན་ལ། །རྒྱལ་པོའི་དམག་གིས་མ་གཙེས་སམ། །
en: When you were in the forest Making burnt offerings and reciting mantras, Were you harassed by the king’s army?

source: འཁྲུགས་ཤིང་ལམ་སྲང་དག་ཏུ་རྒྱུ། །
en: You are disturbed and wander the streets.’

source: བུ་མོ་ང་ཁྱིམ་གཉེན་འདུན་མེད། །ཡོངས་སུ་གཟུང་བའང་ང་ལ་མེད། །
en: “ ‘Girl, I have neither home nor family, And I have no possessions.

source: འདོད་པའི་ཡོན་ཏན་ང་མི་འདོད། །བུ་མོ་རྒྱལ་དམག་ང་མི་གནོད། །
en: I do not desire the pleasures of the senses, So, girl, the king’s army does not harm me.

source: ང་དེ་དག་ལས་ཟན་མི་ཟ། །ཆོས་གོས་གོས་ཀྱང་མི་ལེན་ཏེ། །
en: “ ‘I do not eat food that comes from them— Even though I wear robes I do not accept it.

source: ཤེས་བཞིན་བརྫུན་ནི་མི་སྨྲ་ན། །བུ་མོ་རྒྱལ་དམག་ང་མི་གནོད། །
en: I do not knowingly tell lies, So, girl, the king’s army does not harm me.

source: འབྲས་བུ་རྩ་བས་ནགས་ན་གནས། །བུ་མོ་རྒྱལ་དམག་ང་མི་གནོད། །
en: “ ‘I live in the forest on fruits and roots, So, girl, the king’s army does not harm me.’

source: སེང་ཕྲུག་དག་གིས་མ་གཙེས་སམ། །འབྲས་རྩ་ནགས་ན་མེད་དམ་ཅི། །
en: “ ‘Were you attacked by lion cubs, Or were there no fruits or roots in the forest?

source: ཅིའི་ཕྱིར་ཁྱོད་ནི་བརྟན་པར་འོངས། །
en: Why did you come to this settled place?’

source: སེང་གེའི་ཕྲུག་གུས་མ་གཙེས་ཏེ། །ནགས་ན་འབྲས་བུ་རྩ་བ་ཡོད། །
en: “ ‘I was not harmed by lion cubs, And in the forest there are fruits and roots.

source: བཟང་མོ་ཨུད་པལ་དགོས་པའི་ཕྱིར། །དེ་ཕྱིར་ང་འདིར་གྲོང་ཁྱེར་འོངས། །
en: Good lady, it is because I need utpala flowers That I came here to the city.’

source: གལ་ཏེ་ཤེད་བུ་ལང་ཙོ་ཡིས། །དྲེགས་ལུས་བརྒྱན་ཕྱིར་བྲམ་ཟེ་ཁྱེའུ། །
en: “ ‘Perhaps, young brahmin, my utpala flowers Would be suitable to adorn the proud body Of some young man.’

source: བདག་གི་ཨུད་པལ་འཚམ་པ་ཡིན། །བདག་གི་ཕྲེང་ཕྱིར་མི་ཉོ་ལ། །
en: “ ‘I do not buy them for my own garland.

source: ཨུད་པལ་བསྣམས་ཕྱིར་འདོད་པ་མིན། །
en: I do not desire to carry around utpala flowers.

source: བརྩེ་ལྡན་མར་མེ་མཛད་ཀྱི་ཕྱིར། །བཟང་མོ་བདག་ནི་ཨུད་པལ་སློང་། །
en: It is for the sake of the compassionate Dīpaṅkara, Good lady, that I beg for these utpala flowers.’

source: བདེ་བར་ཕ་རོལ་འགྲོ་བ་ན། །གང་དུ་ཕ་ལས་ཟན་ཟོས་ཚེ། །བསླང་བའི་ཚིག་སྨྲས་མི་དྲན་ནས། །
en: “ ‘In Gone to Bliss, When you ate my father’s food, You disregarded his pleading words.

source: འཛེམ་མེད་ཅི་ཕྱིར་མེ་ཏོག་སློང་། །
en: How can you shamelessly beg for flowers?’

source: བཟང་མོ་ཨུད་པལ་རིན་དུ་དབྱིག །ལྔ་བརྒྱ་འདི་བྱིན་དགེ་མས་གནང་། །
en: “ ‘Good lady, as payment for your utpalas, I will give these five hundred coins.

source: སངས་རྒྱས་ཡོན་ཏན་ཚོལ་བ་ལ། །
en: May the noble lady grant them to me In my search for qualities of the Buddha.

source: བཟང་མོ་བགེགས་ནི་མ་བྱེད་ཅིག །
en: “ ‘Good lady, do not be a hindrance.

source: བཟང་མོ་བདག་གི་གཞི་བྱས་ནས། །སློང་བ་རྣམས་ཀྱི་བགེགས་སུ་འགྱུར། །
en: Good lady, being made to settle down Is a hindrance for those who seek alms.’

source: གཞན་ལྟ་ཞོག་གི་བྲམ་ཟེའི་ཁྱེའུ། །
en: “ ‘Forget about others, young brahmin.

source: གལ་ཏེ་སློང་ལ་བདག་བྱིན་ན། །བདག་ནི་ཁྱོད་ཀྱི་བགེགས་མི་བྱེད། །
en: If I give to one who seeks alms, I will not be a hindrance.

source: བདག་སྨོན་འདིར་གྱུར་གཞན་དུ་མིན། །
en: My aspiration is for this and nothing else.’
